app/views/reactions/_stamp.html.erb

  <div class="flex flex-wrap gap-1 mb-2">
    <% post.reactions.group(:emoji).count.each do |emoji, count| %>
      <% user_emoji = current_user && post.reactions.find_by(user: current_user, emoji: emoji) %>
---
SELECT "reactions".* FROM "reactions" WHERE "reactions"."post_id" = $1 AND "reactions"."id" = $2 LIMIT $3  [["post_id", 3501], ["id", 1007], ["LIMIT", 1]]
SELECT COUNT(*) AS "count_all", "reactions"."emoji" AS "reactions_emoji" FROM "reactions" WHERE "reactions"."post_id" = $1 GROUP BY "reactions"."emoji"  [["post_id", 3486]]
SELECT "reactions".* FROM "reactions" WHERE "reactions"."post_id" = $1 AND "reactions"."user_id" = $2 AND "reactions"."emoji" = $3 LIMIT $4  [["post_id", 3497], ["user_id", 5203], ["emoji", "🍔"], ["LIMIT", 1]]