app/views/posts/_time.html.erb

<span class="ml-2  text-gray-400">
<%=
  time = Time.now - post.created_at
---
INSERT INTO "posts" ("title", "photo", "song_id", "song_name", "artist_name", "album_name", "audio", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"