app/views/posts/_unlike.html.erb

<%= link_to like_path(current_user.likes.find_by(post_id: post.id)), id: "unlike-button-for-post-#{post.id}", data: { turbo_method: :delete }, class: "text-gray-400 hover:text-red-700" do %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2 LIMIT $3  [["user_id", 5177], ["post_id", 3484], ["LIMIT", 1]]