app/views/posts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
              <div class="flex items-center space-x-2">
              <%= image_tag(@post.user.icon_url.to_s, class: 'rounded-full w-8 h-8 mr-1 ') if @post.user.icon_url.present? %>