app/controllers/likes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3495], ["LIMIT", 1]]
---
  def create
    @post = Post.find(params[:post_id])

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."id" = $2 LIMIT $3  [["user_id", 5177], ["id", 224], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3484], ["LIMIT", 1]]
---
  def destroy
    @post = current_user.likes.find(params[:id]).post