app/controllers/password_resets_controller.rb

SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = 'zNNKofxgReMvuvzfik4N' ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def edit
    @token = params[:id]
    @user = User.load_from_reset_password_token(@token)
    not_authenticated if @user.blank?

SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = 'ZPED3ub4AXakzCtVMoqS' ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def update
    @token = params[:id]
    @user = User.load_from_reset_password_token(@token)

    return not_authenticated if @user.blank?