app/controllers/posts_controller.rb

  def index
    @posts = Post.includes(:user, :tags).order(created_at: :desc)
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN ($1, $2, $3)  [["id", 1176], ["id", 1177], ["id", 1178]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 5178], ["id", 5176]]
SELECT DISTINCT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "photo", "song_id", "song_name", "artist_name", "album_name", "audio", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def edit
    @post = current_user.posts.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 5190], ["id", 3491], ["LIMIT", 1]]

  def update
    @post = current_user.posts.find(params[:id])
    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 5190], ["id", 3491], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "song_name" = $2, "artist_name" = $3, "album_name" = $4, "updated_at" = $5 WHERE "posts"."id" = $6  [["title", "updated_title"], ["song_name", ""], ["artist_name", ""], ["album_name", ""], ["updated_at", "2024-12-11 07:15:19.751499"], ["id", 263]]

  def likes
    @like_posts = Post.joins(:likes)
    .where(likes: { user_id: current_user.id })
    .order(created_at: :desc)
---
SELECT "posts".* FROM "posts" INNER JOIN "likes" ON "likes"."post_id" = "posts"."id" WHERE "likes"."user_id" = $1 ORDER BY "posts"."created_at" DESC  [["user_id", 5193]]

  def mine
    @mine = current_user.posts.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC  [["user_id", 5195]]

  def destroy
    post = current_user.posts.find(params[:id])
    post.destroy!
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 5192], ["id", 3493], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 3493]]