app/controllers/profiles_controller.rb

UPDATE "users" SET "email" = $1, "name" = $2, "updated_at" = $3, "icon" = $4 WHERE "users"."id" = $5  [["email", "update@example.com"], ["name", "update_name"], ["updated_at", "2024-12-20 08:47:11.999709"], ["icon", "test.jpg"], ["id", 5197]]
---
  def update
    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5197], ["LIMIT", 1]]
---
  def set_user
    @user = User.find(current_user.id)