app/controllers/reactions_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @reaction = @post.reactions.create(reaction_params.merge(user: current_user))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3497], ["LIMIT", 1]]
INSERT INTO "reactions" ("user_id", "post_id", "emoji", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 5203], ["post_id", 3497], ["emoji", "🫨"], ["created_at", "2024-12-20 08:47:15.462489"], ["updated_at", "2024-12-20 08:47:15.462489"]]

  def destroy
    @post = Post.find(params[:post_id])
    @reaction = @post.reactions.find_by(id: params[:id])
    @reaction&.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3501], ["LIMIT", 1]]
SELECT "reactions".* FROM "reactions" WHERE "reactions"."post_id" = $1 AND "reactions"."id" = $2 LIMIT $3  [["post_id", 3501], ["id", 1007], ["LIMIT", 1]]
DELETE FROM "reactions" WHERE "reactions"."id" = $1  [["id", 1007]]